import { defineStore } from 'pinia';

export interface Document {
  title: string;
  intro: string;
  description: string;
  author: string;
  year?: number;
}

export const useDocumentsStore = defineStore('documents', {
  state: () => ({
    documents: [
      {
        title: 'Осередок товариства української мови ім. Тараса Шевченка у Добромилі',
        intro: '<p>Відлунням національного відродження, героїка минулого України, глибоке розуміння духовних вартостей, які ми маємо, глибоко вкарбувалися в генах нас, українців, синів і дочок, небайдужих до перемін і святої віри в здійснення нашої віковічної мрії - Незалежності і волі народу і дало крок до створення первинного осередку Товариства української мови ім Т. Шевченка "Просвіта".</p>',
        description: '<p>Відлунням національного відродження, героїка минулого України, глибоке розуміння духовних вартостей, які ми маємо, глибоко вкарбувалися в генах нас, українців, синів і дочок, небайдужих до перемін і святої віри в здійснення нашої віковічної мрії - Незалежності і волі народу і дало крок до створення первинного осередку Товариства української мови ім Т. Шевченка "Просвіта".</p><p>І родилося воно наприкінці вісімдесятих минулого XX століття. А саме 11 серпня 1989р. відбулося перше засідання членів осередку (30чол.) (це інженерно-технічні працівники, робітники ДОКу Добромиль). Були також присутні депутати міської ради.</p><p>Товариство працювало у наступних напрямках:</p><ul><li>створені секції: просвітницька (її очолив Ігор Сулик); історична (М. М. Бац); фолькльорно-етнографічна (М. Наливайко)</li><li>відбувся перший похід на цвинтар (о. Корч) з нашим прапором (Орест Гладьо, Микола Шатинський)</li><li>організовано зібрання членів осередку, читання лекцій, в тому числі про символи державності - про тризуб (Б. Мушора), прапор (М. Бац)</li><li>відновлено могили (відомих та невідомих), в котрих знайшли свій спочинок свідки Голгофи України. Але своїми стражданнями, життям, вірою і боротьбою запалили світанкову зорю України.</li></ul><p>В день перепоховання в Києві Стуса, Литвина, Тихого, 21 листопада 1989р. проведено перший концерт членів товариства осередку Просвіта ДОКу "Доборомиль". Захід повторений відбувся у Добромилі, Нижанковичах, Хирові, Старяві - 4 грудня, де заколядували з присутніми у залі.</p><p>18 грудня вперше в м. Добромиль запросили жителів міста з дітьми на свято Св. Миколая - "А хто, хто Миколая любить". Афішу (запрошення) на свято зривали. Ігор Сулик малював ще раз. Вивішували на витринах магазинів, де дозволяли продавці, бо не всі були згідні з тим, щоб свято відбулось... А ми це робили, бо це наше свято, традиція, відроджували для дітей таку радість - зустріч з добром, зі Св. Миколаєм. І так попри різні перешкоди і заперечення, зриви, свято відбулося, зібравши повний зал людей.</p><p>Згодом різдвяні свята (концерт-вистава 20 січня 1990р.). 22 січня - концерт до дня Злуки.</p><p>90-й рік - перший похід на Саліну (проведено підготовку території, чистку могили).</p><p>1 травня 1990р. - перша демонстрація робітників пройшла під нашими знаменами. Ми йшли колоною з ДОКу (несемо десятки прапорів). Приєдналися до нас школа, училище (але стягів ще не мали).</p><p>90-й рік - прапор на міській раді встановив Ярослав Угрин.</p><p>1-ше вересня члени осередку з портретами Т. Шевченка та І. Франка в школі для першокласників.</p><p>Осінь 1990р. - демонтували пам\'ятник Леніну. Цьому передувала заява від членів осередку товариства української мови ім. Т. Шевченка ДОКу "Добромиль", рішення сесії міської Ради народних депутатів.</p>',
        author: '<em>Зі спогадів п. Марії Наливайко, 2020р.</em>',
        year: 2020,
      },
    ] as Document[],
  }),
  getters: {
    articles(state) {
      return state.documents;
    },
  },
});
